import { EducationInterface } from '@/types/types';

export const Educations: EducationInterface[] = [
  {
    title: '삼성 청년 소프트웨어 아카데미',
    date: '2022.07 ~ 2023.06',
    info: [
      '삼성 청년 소프트웨어 아카데미를 수료했습니다.',
      '알고리즘 중심의 몰입형 코딩 커리큘럼을 따라가며, 추가적인 학습을 통해 프론트엔드 개발자로서의 기초를 다졌습니다.',
      '그리고 실전형 프로젝트 과정을 통해 학습한 프론트엔드 기술을 학습, 사용하고 협업 능력을 키웠습니다.',
    ],
  },
  {
    title: '자바 국비 과정 (전주 이젠 아카데미)',
    date: '2021.12 ~ 2022.06',
    info: [
      '자바 국비 과정을 수료했습니다.',
      '프로그래밍의 기초를 다질 수 있었고, 프론트엔드 개발에 관심을 가지게 되었습니다.',
      'Java 뿐 아니라 HTML, CSS, JavaScript, jQuery, JSP, Spring 등을 배웠습니다.',
    ],
  },
  {
    title: '국민대학교',
    date: '2015.03 ~ 2022.02',
    info: [
      '사회학과를 졸업했습니다.',
      '교양으로 들은 컴퓨터 프로그래밍 수업을 통해 개발자의 길을 걷게 되었습니다.',
    ],
  },
];
